app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-01-14 17:44:11.608042"], ["updated_at", "2019-01-14 17:44:11.608042"]]
---
  def create
    @article = Article.create(title: params[:article][:title], description: params[:article][:description])

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-01-14 18:01:01.609127"], ["id", 1]]
---
  def update
    @article.update(title: params[:article][:title], description: params[:article][:description])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_article
      @article = Article.find(params[:id])